<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Pharos Popup client.</string>
	<key>Identifier</key>
	<string>com.github.asemak.download.popup</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Popup</string>
		<key>SEARCH_URL</key>
		<string>https://pharos.com/uniprint/mac-updates/</string>
		<key>DOWNLOAD_URL</key>
		<string>https://pharos.com/support/downloads/mac</string>
		<key>DOWNLOAD_PREFIX</key>
		<string>Mac OS X Popups</string>
    	</dict>
    	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
        		<dict>
          			<key>re_pattern</key>
          			<string>%DOWNLOAD_PREFIX% ([0-9]{1,2}.[0-9]{1,2}.[0-9]{1,2}).zip</string>
          			<key>result_output_var_name</key>
          			<string>version</string>
          			<key>url</key>
          			<string>%SEARCH_URL%</string>
        		</dict>
      		</dict>
      		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%/%DOWNLOAD_PREFIX% %version%.zip</string>
			</dict>
		</dict>
    		<dict>
      			<key>Processor</key>
      			<string>EndOfCheckPhase</string>
    		</dict>
    		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzipped</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
    		<dict>
        		<key>Processor</key>
        		<string>CodeSignatureVerifier</string>
        		<key>Arguments</key>
        		<dict>
            			<key>input_path</key>
            			<string>%RECIPE_CACHE_DIR%/unzipped/%DOWNLOAD_PREFIX% %version%/%NAME%.dmg/%NAME%.pkg</string>
            			<key>expected_authority_names</key>
            			<array>
                			<string>Developer ID Installer: Pharos Systems International (QMY9322U6D)</string>
                			<string>Developer ID Certification Authority</string>
                			<string>Apple Root CA</string>
            			</array>
        		</dict>
      		</dict>
	</array>
</dict>
</plist>
