<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Adobe Creative Cloud Desktop App and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.asemak.munki.creativeclouddesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CreativeCloudDesktopApp</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/adobe</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Creative Cloud desktop app lets you download, install, and update your Creative Cloud apps. Follow the instructions below to download and install the app.</string>
            <key>display_name</key>
            <string>Creative Cloud Desktop App</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.AdobeCreativeCloudInstaller</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The asemak-recipes repository is deprecated and will be removed in the future.
Details: https://github.com/autopkg/autopkg/issues/740
                </string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/AdobeCreativeCloudInstaller-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
