<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Isadora.</string>
    <key>Identifier</key>
    <string>com.github.asemak.download.isadora</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Isadora</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                  <key>re_pattern</key>
                  <string>files/isadoramac-(.*)-std.dmg</string>
                  <key>result_output_var_name</key>
                  <string>version</string>
                  <key>url</key>
                  <string>https://troikatronix.com/get-it/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://troikatronix.com/files/isadoramac-%version%-std.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
